# PeriodicCurveBadParams Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CurveFailures..::..PeriodicCurveBadParams Property
BuiltInFailures..::..CurveFailures Class See Also
---
End positions are invalid.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId PeriodicCurveBadParams { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PeriodicCurveBadParams As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ PeriodicCurveBadParams {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CurveFailures Class
Autodesk.Revit.DB Namespace